# -*- mode: org; coding:utf-8; -*-
#+TITLE: Do regression fitting on Org Mode tables
#+OPTIONS: ^:{} authors:Thierry Banel toc:nil

Regression fitting predicts numerical values of a column based on
other columns. The closer the predicted values to the observed values,
the better the fit is.

* Dates
Dates in tables are converted to a number of days since January 1st
year 1. Therefore columns of dates can be used as numeric columns.

However, the spreadsheet formula added by ~orgtbl-fit~ may need to be
ajusted manually. The ~date()~ function is handy. It can convert a date
to a number of days and back again. As an example, we want to explain
the ~num~ column by the ~event~ column. ~orgtbl-fit~ gives:

#+begin_example
| event            | num | Best Fit                                 | Fit Diff                                 |
|------------------+-----+------------------------------------------+------------------------------------------|
| [2023-01-08 Sun] | 1.1 | 0.037186948*[2023-01-08 Sun] - 27462.367 | 0.037186948*[2023-01-08 Sun] - 27463.467 |
| [2023-02-08 Wed] | 2.6 | 0.037186948*[2023-02-08 Wed] - 27462.367 | 0.037186948*[2023-02-08 Wed] - 27464.967 |
| [2023-03-03 Fri] | 3.2 | 0.037186948*[2023-03-03 Fri] - 27462.367 | 0.037186948*[2023-03-03 Fri] - 27465.567 |
| [2023-05-17 Wed] | 6.0 | 0.037186948*[2023-05-17 Wed] - 27462.367 | 0.037186948*[2023-05-17 Wed] - 27468.367 |
,#+TBLFM: $3=0.0371869477971*$1 - 27462.3666844::$4=$3-$2
#+end_example

Let us adjust manually ~$1~ to ~date($1)~:

#+begin_example
#+end_example
| event            | num |  Best Fit |   Fit Diff |
|------------------+-----+-----------+------------|
| [2023-01-08 Sun] | 1.1 | 1.2354983 |  0.1354983 |
| [2023-02-08 Wed] | 2.6 | 2.3882937 | -0.2117063 |
| [2023-03-03 Fri] | 3.2 | 3.2435935 |  0.0435935 |
| [2023-05-17 Wed] | 6.0 | 6.0326146 |  0.0326146 |
#+TBLFM: $3=0.0371869477971*date($1) - 27462.3666844::$4=$3-$2

Better.

